app/controllers/claims_controller.rb

  def index
    render json: Claim.all
---
SELECT "claims".* FROM "claims"

  def show
    @claim = Claim.find(params[:id])
---
SELECT "claims".* FROM "claims" WHERE "claims"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @claim = Claim.new(claim_params)
    @claim.save
---
INSERT INTO "claims" ("full_name", "reference", "tel_number", "email", "address_line1", "town", "post_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @claim = Claim.find(params[:id])
---
SELECT "claims".* FROM "claims" WHERE "claims"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def update
    @claim = Claim.find(params[:id])
    if @claim.update(claim_params)
---
SELECT "claims".* FROM "claims" WHERE "claims"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "claims" SET "full_name" = $1, "updated_at" = $2 WHERE "claims"."id" = $3  [["full_name", "\"milo\""], ["updated_at", "2023-03-29 09:05:36.589783"], ["id", 1]]

  def destroy
    @task = Claim.find(params[:id])
    @task.destroy
---
SELECT "claims".* FROM "claims" WHERE "claims"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "claims" WHERE "claims"."id" = $1  [["id", 1]]